Case_5/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 50;

vertices
(
    (-1 -1 -1)
    ( 1 -1 -1)
    ( 1  1 -1)
    (-1  1 -1)
    (-1 -1  1)
    ( 1 -1  1)
    ( 1  1  1)
    (-1  1  1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (110 110 110) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch in
    (
        (0 4 7 3)
    )
    patch out
    (
        (2 6 5 1)
    )
    patch top
    (
        (3 7 6 2)
    )
    patch bottom
    (
        (1 5 4 0)
    )
    wall back
    (
        (0 3 2 1)
    )
    wall front
    (
        (4 5 6 7)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
