Case_5/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-06;
        relTol           0;
    };

    U
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0;
    };
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;

    pRefCell  0;
    pRefValue 0;
}

potentialFlow
{
    nNonOrthogonalCorrectors 2;
}

// ************************************************************************* //

/*solvers*/
/*{*/
/*    p*/
/*    {*/
/*        solver           CG;*/
/*        preconditioner   Cholesky;*/

/*        minIter          1;*/
/*        maxIter          1000;*/
/*        tolerance        1e-06;*/
/*        relTol           0;*/
/*    };*/

/*    U*/
/*    {*/
/*        solver           BiCGStab;*/
/*        preconditioner   ILU0;*/

/*        minIter          1;*/
/*        maxIter          1000;*/
/*        tolerance        1e-08;*/
/*        relTol           0;*/
/*    };*/
/*}*/

/*PISO*/
/*{*/
/*    nCorrectors     2;*/
/*    nNonOrthogonalCorrectors 0;*/
/*    pRefCell        0;*/
/*    pRefValue       0;*/
/*}*/
/*    */

   

// ************************************************************************* //
